[
  {
    "name": "Semester Conversion Steering Committee",
    "chairperson": "Cameron Carpenter",
    "plans-goals": "The goal of the Semester Conversion Steering Committee is to help MSOE further its diversity and inclusion. The purpose is to appeal more to transfer students and make it easier for transfer students to come to MSOE without falling behind or becoming overwhelmed. The flexibility of the program tracks and weekly schedules will allow different delivery methods for classes, allow for an easier process for students to dual major, and appeal to students on an accelerated track. The conversion is in hopes to create longevity as an institution of higher education that incorporates streamlined processes and procedures to increase efficiency within departments and the university as a whole."
  },
  {
    "name": "Food Concerns Committee",
    "chairperson": "Owen Podziemski",
    "plans-goals": "The goal of the food Concerns Committee is to serve as an open line of communication between the student body and ADC to see the continued improvement of the food services on campus."
  },
  {
    "name": "Constitution Revision Committee",
    "chairperson": "Cameron Carpenter and Michael Nelson",
    "plans-goals": "The plan of the Constitution Revision Committee is to address all issues presented or found, to bring amendments before the General Assembly, and then to close the committee. The future goals is to address all concerns pertaining to the Constitution and Bylaws in order to best fit the current context of the world and to be aligned with the principles of Stu Gov."
  },
  {
    "name": "Facilities and Buildings Improvements (FBI) Committee",
    "chairperson": "Robi Roy",
    "plans-goals": "The Facilities and Buildings Improvements Committee plans to maintain and improve MSOE institutions on campus. Going into the next school year, I would like to start making weekly emails to Facilities which can encompass student concerns."
  },
  {
    "name": "Ad Hoc Committee Investigating Tuition Increase",
    "chairperson": "Owen Podziemski",
    "plans-goals": "The Ad Hoc Committee Investigating Tuition increases plans to serves as an open line of communication with the Administration about increasing transparency about tuition increases and providing relevant parties with a breakdown of where the costs are going and why, as well as changing the tuition increase letter to an opt-out system instead of an opt-in system."
  },
  {
    "name": "Computer User Committee",
    "chairperson": "Paul Rinaldi",
    "plans-goals": "This committee develops and works on the future of computing at MSOE for both faculty and students pertaining to hardware and software. One student government representative is assigned to this committee and is a voting member." 
  }
]
